app/views/catarse_bootstrap/projects/_reward_fields.html.slim

                  .btn.btn-small.btn-terciary.fa.fa-lg.fa-edit.btn-no-border
            /.fontsize-smaller.u-marginbottom-20.fontweight-semibold= pluralize(reward.payments.with_state('paid').count(:all), t('contribution_singular'), t('contribution_plural'))
---
SELECT COUNT(DISTINCT contributions.id) FROM "payments" INNER JOIN "contributions" ON "payments"."contribution_id" = "contributions"."id" WHERE "contributions"."reward_id" = $1 AND ("payments"."state" IN ('paid','pending'))  [["reward_id", 1]]