app/views/catarse_bootstrap/rewards/index.html.slim

SELECT COUNT(*) FROM "contributions"  WHERE "contributions"."reward_id" = $1 AND (contributions.is_confirmed)  [["reward_id", 1]]
---
      .fontsize-base.fontweight-semibold = t('.reward_title', minimum: reward.job_title).html_safe
      /.fontsize-smaller.fontweight-semibold = pluralize(reward.contributions.where('contributions.is_confirmed').count(:all), t('contribution_singular'), t('contribution_plural'))