app/views/catarse_bootstrap/shared/_user_menu.html.slim

        ul.w-list-unstyled.u-marginbottom-20
          - current_user.projects.without_state('rejected').ordered.limit(3).each do |project|
---
SELECT  "projects".* FROM "projects"  WHERE "projects"."user_id" = $1 AND ("projects"."state" NOT IN ('deleted')) AND ("projects"."state" NOT IN ('rejected'))  ORDER BY "projects"."created_at" DESC LIMIT 3  [["user_id", 1]]